{"acid green": 0, "adobe": 1, "algae": 2, "algae green": 3, "almost black": 4, "amber": 5, "amethyst": 6, "apple": 7, "apple green": 8, "apricot": 9, "aqua": 10, "aqua blue": 11, "aqua green": 12, "aquamarine": 13, "army green": 14, "asparagus": 15, "aubergine": 16, "auburn": 17, "avocado": 18, "avocado green": 19, "azure": 20, "baby blue": 21, "baby green": 22, "baby pink": 23, "baby poop": 24, "baby poop green": 25, "baby puke green": 26, "baby shit green": 27, "banana": 28, "banana yellow": 29, "barbie pink": 30, "barf": 31, "barf green": 32, "barney": 33, "barney purple": 34, "battleship grey": 35, "beige": 36, "berry": 37, "biege": 38, "bile": 39, "black": 40, "blood": 41, "blood orange": 42, "blood red": 43, "blue": 44, "blue green": 45, "blue grey": 46, "blue purple": 47, "blue violet": 48, "blueberry": 49, "blueish": 50, "bluey green": 51, "bluey grey": 52, "bluey purple": 53, "bluish green": 54, "bluish grey": 55, "bluish purple": 56, "blurple": 57, "blush": 58, "blush pink": 59, "booger green": 60, "bottle green": 61, "brick": 62, "brick orange": 63, "brick red": 64, "bright aqua": 65, "bright blue": 66, "bright cyan": 67, "bright fuchsia": 68, "bright green": 69, "bright indigo": 70, "bright lavender": 71, "bright light blue": 72, "bright light green": 73, "bright lilac": 74, "bright lime": 75, "bright lime green": 76, "bright magenta": 77, "bright olive": 78, "bright orange": 79, "bright pink": 80, "bright purple": 81, "bright red": 82, "bright sea green": 83, "bright sky blue": 84, "bright teal": 85, "bright turquoise": 86, "bright violet": 87, "bright yellow": 88, "bright yellow green": 89, "british racing green": 90, "bronze": 91, "brown": 92, "brown green": 93, "brown grey": 94, "brown orange": 95, "brown red": 96, "brown yellow": 97, "brownish": 98, "brownish green": 99, "brownish grey": 100, "brownish orange": 101, "brownish pink": 102, "brownish purple": 103, "brownish red": 104, "brownish yellow": 105, "bubblegum": 106, "bubblegum pink": 107, "buff": 108, "burgundy": 109, "burnt orange": 110, "burnt red": 111, "burnt sienna": 112, "burnt umber": 113, "burnt yellow": 114, "butter": 115, "butter yellow": 116, "butterscotch": 117, "cadet blue": 118, "camel": 119, "camo green": 120, "camouflage green": 121, "canary": 122, "canary yellow": 123, "caramel": 124, "carnation": 125, "carnation pink": 126, "carolina blue": 127, "caucasian": 128, "celadon": 129, "celery": 130, "celery green": 131, "cerise": 132, "cerulean": 133, "cerulean blue": 134, "charcoal": 135, "chartreuse": 136, "cherry": 137, "cherry red": 138, "chestnut": 139, "chocolate": 140, "chocolate brown": 141, "claret": 142, "clay": 143, "clay brown": 144, "cobalt": 145, "cobalt blue": 146, "cocoa": 147, "coffee": 148, "cool blue": 149, "cool green": 150, "cool grey": 151, "copper": 152, "coral": 153, "coral pink": 154, "cornflower": 155, "cornflower blue": 156, "cranberry": 157, "cream": 158, "crimson": 159, "cyan": 160, "dandelion": 161, "dark aqua": 162, "dark aquamarine": 163, "dark beige": 164, "dark blue": 165, "dark blue green": 166, "dark blue grey": 167, "dark brown": 168, "dark coral": 169, "dark cream": 170, "dark cyan": 171, "dark forest green": 172, "dark fuchsia": 173, "dark gold": 174, "dark green": 175, "dark grey": 176, "dark grey blue": 177, "dark hot pink": 178, "dark indigo": 179, "dark khaki": 180, "dark lavender": 181, "dark lilac": 182, "dark lime": 183, "dark lime green": 184, "dark magenta": 185, "dark maroon": 186, "dark mauve": 187, "dark mint": 188, "dark mint green": 189, "dark mustard": 190, "dark navy": 191, "dark navy blue": 192, "dark olive": 193, "dark olive green": 194, "dark orange": 195, "dark peach": 196, "dark periwinkle": 197, "dark pink": 198, "dark plum": 199, "dark purple": 200, "dark red": 201, "dark rose": 202, "dark royal blue": 203, "dark sage": 204, "dark salmon": 205, "dark sand": 206, "dark sea green": 207, "dark seafoam": 208, "dark seafoam green": 209, "dark sky blue": 210, "dark slate blue": 211, "dark tan": 212, "dark taupe": 213, "dark teal": 214, "dark turquoise": 215, "dark violet": 216, "dark yellow": 217, "dark yellow green": 218, "darker blue": 219, "darker green": 220, "darker pink": 221, "darker purple": 222, "darkish blue": 223, "darkish green": 224, "darkish purple": 225, "darkish red": 226, "deep aqua": 227, "deep blue": 228, "deep green": 229, "deep lavender": 230, "deep lilac": 231, "deep magenta": 232, "deep orange": 233, "deep pink": 234, "deep purple": 235, "deep red": 236, "deep rose": 237, "deep sky blue": 238, "deep teal": 239, "deep violet": 240, "denim": 241, "denim blue": 242, "diarrhea": 243, "dirt": 244, "dirt brown": 245, "dirty blue": 246, "dirty green": 247, "dirty orange": 248, "dirty pink": 249, "dirty yellow": 250, "dodger blue": 251, "drab": 252, "drab green": 253, "dried blood": 254, "duck egg blue": 255, "dull blue": 256, "dull brown": 257, "dull green": 258, "dull orange": 259, "dull pink": 260, "dull purple": 261, "dull red": 262, "dull teal": 263, "dull yellow": 264, "dusk": 265, "dusk blue": 266, "dusky blue": 267, "dusky pink": 268, "dusky purple": 269, "dusky rose": 270, "dusty blue": 271, "dusty green": 272, "dusty orange": 273, "dusty pink": 274, "dusty purple": 275, "dusty red": 276, "dusty rose": 277, "dusty teal": 278, "earth": 279, "easter green": 280, "easter purple": 281, "ecru": 282, "eggplant": 283, "eggshell": 284, "eggshell blue": 285, "electric blue": 286, "electric green": 287, "electric lime": 288, "electric pink": 289, "electric purple": 290, "emerald": 291, "emerald green": 292, "evergreen": 293, "faded blue": 294, "faded green": 295, "faded orange": 296, "faded pink": 297, "faded purple": 298, "faded red": 299, "faded yellow": 300, "fawn": 301, "fern": 302, "fern green": 303, "fire engine red": 304, "flat blue": 305, "flat green": 306, "flesh": 307, "flesh pink": 308, "flesh tone": 309, "flourescent green": 310, "fluorescent green": 311, "fluro green": 312, "foam green": 313, "forest": 314, "forest green": 315, "french blue": 316, "frog green": 317, "fuchsia": 318, "gold": 319, "golden": 320, "golden brown": 321, "golden yellow": 322, "goldenrod": 323, "grape": 324, "grape purple": 325, "grapefruit": 326, "grass": 327, "grass green": 328, "grassy green": 329, "green": 330, "green apple": 331, "green blue": 332, "green brown": 333, "green grey": 334, "green yellow": 335, "greenish": 336, "greenish blue": 337, "greenish brown": 338, "greenish grey": 339, "greenish tan": 340, "greenish teal": 341, "greenish turquoise": 342, "greenish yellow": 343, "greeny brown": 344, "greeny grey": 345, "grey": 346, "grey blue": 347, "grey brown": 348, "grey green": 349, "grey pink": 350, "grey purple": 351, "greyish": 352, "greyish blue": 353, "greyish brown": 354, "greyish green": 355, "greyish pink": 356, "greyish purple": 357, "greyish teal": 358, "gross": 359, "gross green": 360, "gunmetal": 361, "hazel": 362, "heather": 363, "heliotrope": 364, "hiccup": 365, "highlighter green": 366, "horrible": 367, "hospital green": 368, "hot green": 369, "hot magenta": 370, "hot pink": 371, "hot purple": 372, "hunter green": 373, "ice": 374, "ice blue": 375, "icky green": 376, "indian red": 377, "indigo": 378, "indigo blue": 379, "iris": 380, "irish green": 381, "ivory": 382, "jade": 383, "jade green": 384, "jungle green": 385, "kahki": 386, "kelly green": 387, "kermit green": 388, "key lime": 389, "khaki": 390, "khaki green": 391, "kiwi": 392, "kiwi green": 393, "lavender": 394, "lavender blue": 395, "lawn green": 396, "leaf": 397, "leaf green": 398, "leafy green": 399, "leather": 400, "lemon": 401, "lemon lime": 402, "lemon yellow": 403, "light aqua": 404, "light aquamarine": 405, "light beige": 406, "light blue": 407, "light blue green": 408, "light blue grey": 409, "light bright green": 410, "light brown": 411, "light burgundy": 412, "light cyan": 413, "light forest green": 414, "light fuchsia": 415, "light gold": 416, "light grass green": 417, "light green": 418, "light green blue": 419, "light greenish blue": 420, "light grey": 421, "light grey blue": 422, "light indigo": 423, "light kelly green": 424, "light lavender": 425, "light light blue": 426, "light lilac": 427, "light lime": 428, "light lime green": 429, "light magenta": 430, "light maroon": 431, "light mauve": 432, "light mint": 433, "light mint green": 434, "light mustard": 435, "light navy": 436, "light navy blue": 437, "light neon green": 438, "light olive": 439, "light olive green": 440, "light orange": 441, "light pea green": 442, "light peach": 443, "light periwinkle": 444, "light pink": 445, "light plum": 446, "light purple": 447, "light red": 448, "light rose": 449, "light royal blue": 450, "light sage": 451, "light salmon": 452, "light sea green": 453, "light seafoam": 454, "light seafoam green": 455, "light sky blue": 456, "light tan": 457, "light teal": 458, "light turquoise": 459, "light violet": 460, "light yellow": 461, "light yellow green": 462, "lighter blue": 463, "lighter green": 464, "lighter purple": 465, "lightish blue": 466, "lightish green": 467, "lightish purple": 468, "lightish red": 469, "lilac": 470, "lime": 471, "lime green": 472, "lime yellow": 473, "lipstick": 474, "lipstick red": 475, "macaroni and cheese": 476, "magenta": 477, "magneta": 478, "mahogany": 479, "maize": 480, "mango": 481, "marigold": 482, "marine": 483, "marine blue": 484, "maroon": 485, "mauve": 486, "medium blue": 487, "medium brown": 488, "medium green": 489, "medium grey": 490, "medium pink": 491, "medium purple": 492, "melon": 493, "merlot": 494, "metallic blue": 495, "mid blue": 496, "mid green": 497, "midnight": 498, "midnight blue": 499, "midnight purple": 500, "military green": 501, "milk chocolate": 502, "mint": 503, "mint green": 504, "minty green": 505, "mocha": 506, "moss": 507, "moss green": 508, "muave": 509, "mud": 510, "mud brown": 511, "muddy brown": 512, "muddy green": 513, "muddy yellow": 514, "mulberry": 515, "murky green": 516, "mushroom": 517, "mustard": 518, "mustard brown": 519, "mustard green": 520, "mustard yellow": 521, "muted blue": 522, "muted green": 523, "muted pink": 524, "muted purple": 525, "navy": 526, "navy blue": 527, "navy green": 528, "neon blue": 529, "neon green": 530, "neon pink": 531, "neon purple": 532, "neon red": 533, "neon yellow": 534, "night blue": 535, "nude": 536, "ocean": 537, "ocean blue": 538, "ocean green": 539, "ochre": 540, "off blue": 541, "off green": 542, "off white": 543, "off yellow": 544, "olive": 545, "olive brown": 546, "olive drab": 547, "olive green": 548, "orange": 549, "orange brown": 550, "orange red": 551, "orange yellow": 552, "orangey brown": 553, "orangey red": 554, "orangish": 555, "orangish brown": 556, "orangish red": 557, "orchid": 558, "pale": 559, "pale aqua": 560, "pale blue": 561, "pale blue green": 562, "pale brown": 563, "pale cyan": 564, "pale gold": 565, "pale green": 566, "pale grey": 567, "pale lavender": 568, "pale lilac": 569, "pale lime": 570, "pale lime green": 571, "pale magenta": 572, "pale mauve": 573, "pale olive": 574, "pale olive green": 575, "pale orange": 576, "pale peach": 577, "pale pink": 578, "pale purple": 579, "pale red": 580, "pale rose": 581, "pale salmon": 582, "pale sky blue": 583, "pale teal": 584, "pale turquoise": 585, "pale violet": 586, "pale yellow": 587, "pale yellow green": 588, "parchment": 589, "pastel blue": 590, "pastel green": 591, "pastel orange": 592, "pastel pink": 593, "pastel purple": 594, "pastel yellow": 595, "pea": 596, "pea green": 597, "pea soup": 598, "pea soup green": 599, "peach": 600, "peachy pink": 601, "peacock blue": 602, "pear": 603, "periwinkle": 604, "periwinkle blue": 605, "pine": 606, "pine green": 607, "pink": 608, "pink purple": 609, "pink red": 610, "pinkish": 611, "pinkish brown": 612, "pinkish grey": 613, "pinkish orange": 614, "pinkish purple": 615, "pinkish red": 616, "pinky purple": 617, "pinky red": 618, "piss yellow": 619, "pistachio": 620, "plum": 621, "plum purple": 622, "poop": 623, "poop brown": 624, "poop green": 625, "powder blue": 626, "pretty": 627, "primary blue": 628, "prussian blue": 629, "puce": 630, "puke": 631, "puke brown": 632, "puke green": 633, "puke yellow": 634, "pumpkin": 635, "pumpkin orange": 636, "pure blue": 637, "purple": 638, "purple blue": 639, "purple brown": 640, "purple grey": 641, "purple pink": 642, "purple red": 643, "purpley blue": 644, "purpley pink": 645, "purplish": 646, "purplish blue": 647, "purplish brown": 648, "purplish grey": 649, "purplish pink": 650, "purplish red": 651, "putty": 652, "raspberry": 653, "raw sienna": 654, "raw umber": 655, "red": 656, "red brown": 657, "red orange": 658, "red pink": 659, "red purple": 660, "red violet": 661, "reddish": 662, "reddish brown": 663, "reddish orange": 664, "reddish pink": 665, "reddish purple": 666, "reddy brown": 667, "rich blue": 668, "rich purple": 669, "robin's egg": 670, "robin's egg blue": 671, "rose": 672, "rose pink": 673, "rose red": 674, "rosy pink": 675, "rouge": 676, "royal": 677, "royal blue": 678, "royal purple": 679, "ruby": 680, "russet": 681, "rust": 682, "rust orange": 683, "rust red": 684, "rusty orange": 685, "rusty red": 686, "saffron": 687, "sage": 688, "sage green": 689, "salmon": 690, "salmon pink": 691, "sand": 692, "sandstone": 693, "sandy": 694, "sandy brown": 695, "sandy yellow": 696, "sap green": 697, "sapphire": 698, "scarlet": 699, "sea": 700, "sea blue": 701, "sea green": 702, "seafoam": 703, "seafoam blue": 704, "seafoam green": 705, "seaweed": 706, "seaweed green": 707, "sepia": 708, "shamrock": 709, "shamrock green": 710, "shit": 711, "shit brown": 712, "shit green": 713, "shocking pink": 714, "sick green": 715, "sickly green": 716, "sienna": 717, "silver": 718, "skin": 719, "skin colour": 720, "skin tone": 721, "sky": 722, "sky blue": 723, "slate": 724, "slate blue": 725, "slate green": 726, "slate grey": 727, "slime green": 728, "snot": 729, "snot green": 730, "soft blue": 731, "soft green": 732, "soft pink": 733, "soft purple": 734, "spam": 735, "spearmint": 736, "spring green": 737, "squash": 738, "steel": 739, "steel blue": 740, "steel grey": 741, "stone": 742, "stormy blue": 743, "strawberry": 744, "sunflower": 745, "sunflower yellow": 746, "sunshine yellow": 747, "swamp green": 748, "tan": 749, "tan brown": 750, "tangerine": 751, "taupe": 752, "tea green": 753, "teal": 754, "teal blue": 755, "teal green": 756, "tealish": 757, "terracotta": 758, "tiffany blue": 759, "tomato": 760, "tomato red": 761, "topaz": 762, "tree green": 763, "true blue": 764, "true green": 765, "turquoise": 766, "turquoise blue": 767, "turquoise green": 768, "turtle green": 769, "twilight": 770, "twilight blue": 771, "ugly": 772, "ugly green": 773, "ugly pink": 774, "ugly purple": 775, "ugly yellow": 776, "ultramarine": 777, "ultramarine blue": 778, "umber": 779, "velvet": 780, "vermillion": 781, "very dark blue": 782, "very dark green": 783, "very dark purple": 784, "very light blue": 785, "very light green": 786, "very light pink": 787, "very light purple": 788, "very pale blue": 789, "very pale green": 790, "vibrant blue": 791, "vibrant green": 792, "vibrant purple": 793, "violet": 794, "violet blue": 795, "violet pink": 796, "violet red": 797, "viridian": 798, "vivid blue": 799, "vivid green": 800, "vivid purple": 801, "vomit": 802, "vomit green": 803, "vomit yellow": 804, "warm blue": 805, "warm brown": 806, "warm grey": 807, "warm pink": 808, "watermelon": 809, "weird": 810, "weird green": 811, "wheat": 812, "white": 813, "wine": 814, "wine red": 815, "wintergreen": 816, "wisteria": 817, "yellow": 818, "yellow brown": 819, "yellow green": 820, "yellow ochre": 821, "yellow orange": 822, "yellow tan": 823, "yellowish": 824, "yellowish brown": 825, "yellowish green": 826, "yellowish orange": 827, "yuck": 828}